## Pandas

In [1]:
import pandas as pd;

In [85]:
df = pd.DataFrame({
    "Name" : ["Rohit Shah", "MD Masoom", "Arjun Sah", "Rahul Sah", "Surya Sah"],
    "Age" : [20, 21, 22, 23, 21],
    "Sex" : ["male", "male", "male", "male", "male"]
})

In [86]:
df

         Name  Age   Sex
0  Rohit Shah   20  male
1   MD Masoom   21  male
2   Arjun Sah   22  male
3   Rahul Sah   23  male
4   Surya Sah   21  male

In [87]:
## series
## A pandas series is a one dimensional array like object that can hold many data types, such as numbers or strings.

data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [88]:
## create series from dictionary
data = {
    'a' : 1,
    'b' : 2,
    'c' : 3
}

pd.Series(data)

a    1
b    2
c    3
dtype: int64

In [89]:
data = [10,20,30]
index= ['a', 'b', 'c']
pd.Series(data, index)

a    10
b    20
c    30
dtype: int64

In [90]:
## create a Data frame from list of dictionary
details = [
    {
        'Name' : 'Rohit',
        'Age' : 20,
        'city' : 'Odisha',
    },
    {
        'Name' : 'MD Masoom Alam',
        'Age' : 21,
        'city' : 'Odisha'
    }
]

df = pd.DataFrame(details)
df

             Name  Age    city
0           Rohit   20  Odisha
1  MD Masoom Alam   21  Odisha

In [91]:
## read from csv file

df = pd.read_csv("data.csv")
df

   Name  Age         City
0  John   25     New York
1  Anna   22        Paris
2  Mike   32       London
3  Alex   21        Delhi
4   Bob   23  Los Angeles

In [92]:
df.head()

   Name  Age         City
0  John   25     New York
1  Anna   22        Paris
2  Mike   32       London
3  Alex   21        Delhi
4   Bob   23  Los Angeles

In [93]:
df.tail()

   Name  Age         City
0  John   25     New York
1  Anna   22        Paris
2  Mike   32       London
3  Alex   21        Delhi
4   Bob   23  Los Angeles

In [94]:
## Access data from data frame
df['Name']

0    John
1    Anna
2    Mike
3    Alex
4     Bob
Name: Name, dtype: object

In [95]:
df.loc[0]

Name        John
Age           25
City    New York
Name: 0, dtype: object

In [96]:
df.loc[0]

Name        John
Age           25
City    New York
Name: 0, dtype: object

In [97]:
df.iloc[0]

Name        John
Age           25
City    New York
Name: 0, dtype: object

In [98]:
df.loc[0][0]

/tmp/ipykernel_5228/2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'John'

In [99]:
## Accessing a specified element
print(df.at[1, 'City'])

Paris

In [100]:
## Accessing specified element using iat
df.iat[2,2]

'London'

In [101]:
## Adding a column
df['Salary'] = [100,200,300,400,500]
df

   Name  Age         City  Salary
0  John   25     New York     100
1  Anna   22        Paris     200
2  Mike   32       London     300
3  Alex   21        Delhi     400
4   Bob   23  Los Angeles     500

In [103]:
df.drop('Salary', axis=1, inplace=True)

In [105]:
df

   Name  Age         City
0  John   25     New York
1  Anna   22        Paris
2  Mike   32       London
3  Alex   21        Delhi
4   Bob   23  Los Angeles

In [110]:
## Add a age to column
df['Age'] = df['Age'] + 1
df

   Name  Age         City
0  John   28     New York
1  Anna   25        Paris
2  Mike   35       London
3  Alex   24        Delhi
4   Bob   26  Los Angeles

In [112]:
df.drop(0, inplace=True)

In [114]:
df

   Name  Age         City
1  Anna   25        Paris
2  Mike   35       London
3  Alex   24        Delhi
4   Bob   26  Los Angeles

In [116]:
df.describe()

             Age
count   4.000000
mean   27.500000
std     5.066228
min    24.000000
25%    24.750000
50%    25.500000
75%    28.250000
max    35.000000